#### ParameterValueProvider Members

---

|  |
| --- |
| ParameterValueProvider Class   Constructors   Methods   Properties   See Also |

The  ParameterValueProvider  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | ParameterValueProvider | Constructs an instance of ParameterValueProvider. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | (Inherited from  FilterableValueProvider  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetAssociatedGlobalParameterValue | Gets a global parameter value associated with a parameter from the given element. (Inherited from  FilterableValueProvider  .) |
| Public method | GetDoubleValue | Gets a double-precision numeric value from the given element. (Inherited from  FilterableValueProvider  .) |
| Public method | GetElementIdValue | Gets an ElementId value from the given element. (Inherited from  FilterableValueProvider  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetIntegerValue | Gets an integer value from the given element. (Inherited from  FilterableValueProvider  .) |
| Public method | GetStringValue | Gets a string value from the given element. (Inherited from  FilterableValueProvider  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | IsDoubleValueSupported | Determines whether the provide can provide a double-precision numeric value for the given element. (Inherited from  FilterableValueProvider  .) |
| Public method | IsElementIdValueSupported | Determines whether the provide can provide an ElementId value for the given element. (Inherited from  FilterableValueProvider  .) |
| Public method | IsIntegerValueSupported | Determines whether the provide can provide an integer value for the given element. (Inherited from  FilterableValueProvider  .) |
| Public method | IsStringValueSupported | Determines whether the provide can provide a string value for the given element. (Inherited from  FilterableValueProvider  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  FilterableValueProvider  .) |
| Public property | Parameter | The parameter used to provide a string, integer, double-precision, or ElementId value on request for a given element. |

# See Also

ParameterValueProvider Class

Autodesk.Revit.DB Namespace